emacs/emacs-init.org
#+TITLE: Configuración de Emacs
#+AUTHOR: Antonio Moreno
#+PROPERTY: header-args :emacs-lisp :tangle ~/dotfiles/emacs/.emacs.d/init.el :results silent

* Sobre este documento

Este fichero contiene la documentación así como el código de la configuración de =Emacs=, que viene siendo la aplicación que más utilizo en el día a día (programación, gestión de tareas, escritos, ...).

Dado que vengo usando diferentes equipos y sistemas operativos (linux, mac), he decidido centralizar todas las configuraciones en este fichero.

Me he apoyado en distintas referencias. Las más usadas han sido:

- https://gitlab.com/andreyorst/dotfiles/-/blob/master/README.md
- https://gitlab.com/protesilaos/dotfiles/-/raw/master/emacs/.emacs.d/emacs-init.org
- https://github.com/daviwil/dotfiles/raw/master/Emacs.org

Para usar este fichero debemos descargarlo, preferiblemente, en =~/dotfiles/emacs/=, ejecutar =org-babel-tangle= y después reiniciar Emacs. Esta función exportará todo el código a distintos ficheros situados en =~/dotfiles/emacs/.emacs.d/=, según se indica con la propiedad =header-args= al principio del documento y bajo alguno de los encabezados.

** Dotfiles

Toda esta disposición de los ficheros es así por que uso =stow= y =git= para gestionar los /dotfiles/. Aclaro la terminologia:

- *package*: emacs
  Colección de ficheros y directorios de una aplicación que queremos administrar (Emacs)

- *stow directory*: =~/dotfiles=
  Directorio que contiene los paquetes en distintos subdirectorios.

- *target directory*: =~/=
  Es el directorio donde deben aparecer enlazados los ficheros

También guardo en el 'stow directory' los documentos /generadores/ =.org=, como éste mismo, que no se enlazarán pero que sí serán versionados con =git=. Para distinguirlos, he creado el fichero =~/.stow-global-ignore=, donde se excluyen los ficheros generadores =.org= y algunos otros.

Para utilizar este sistema en un equipo nuevo, lo primero sería clonar =dotfiles= y ejecutar el comando =stow= y el paquete que queramos. Por ejemplo,

#+begin_EXAMPLE sh

stow emacs

#+end_EXAMPLE

* =early-init.el=
:PROPERTIES:
:header-args+: :tangle "~/dotfiles/emacs/.emacs.d/early-init.el"
:END:

Aunque suelo tener funcionando Emacs todo el tiempo, hay veces que no. En esos casos siempre quiero que, cuando lo necesite, arranque lo más rápido posible.

A partir de Emacs 27, la inicilización del programa ha cambiado. Ahora todo lo que queramos hacer antes del arranque del programa lo tendremos que indicar en el fichero =early-init.el=. Por tanto, crearemos este fichero con algunas configuraciones.

Lo primero será comentar adecuadamente el fichero:

#+begin_src emacs-lisp
  ;;; early-init.el --- early configuration file -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-
  ;;;
  ;;; Comentario:
  ;;; Configuración de Emacs de Antonio Moreno.
  ;;; Este fichero ha sido generado automáticamente con `org-babel-tangle'.
  ;;; No cambie este fichero. Fichero generador: emacs-init.org en `user-emacs-directory'
  ;;;
  ;;; Código:
#+end_src

Los ajustes iniciales:

** Recolector de basura

Aceleración del arranque ajustando el sistema de recolección de basura. Este sistema tiene un gran impacto en Emacs. Podemos espaciar el tiempo que tarda en activarse, pero esto repercutirá en el rendimiento cuando editemos. Por ello, solo lo ajustaremos durante el proceso de arranque. Almacenamos los valores iniciales para restaurarlos más tarde.

#+begin_SRC emacs-lisp

  (defvar ammz/gc-cons-threshold gc-cons-threshold) ;800000
  (defvar ammz/gc-cons-percentage gc-cons-percentage) ;0.1

#+end_SRC

Cambiamos el umbral (threshold) de activación.

#+begin_SRC emacs-lisp

  (setq-default gc-cons-threshold (* 50 1000 1000)
                gc-cons-percentage 0.6)

#+end_SRC

Por último, con un hook restauramos los valores iniciales

#+begin_SRC emacs-lisp

  (add-hook 'after-init-hook
            (lambda ()
              (setq gc-cons-threshold ammz/gc-cons-threshold)
              (setq gc-cons-percentage ammz/gc-cons-percentage)))

#+end_SRC

** Limpieza de la UI

Deshabilitamos algunos elementos de la interfaz gráfica lo antes posible para que no molesten. Sin embargo, mantengo el menubar con OS X.

#+begin_SRC emacs-lisp

  (unless (eq system-type 'darwin)		; Solo si no es Os X
    (menu-bar-mode -1))					; Deshabilita la menubar
  (scroll-bar-mode -1)					; Deshabilita la scrollbar
  (tool-bar-mode -1) 					; Deshabilita la toolbar

#+end_SRC

** Gestión de paquetes

*** =straight.el=

Para gestionar la instalación de paquetes uso =straight.el=, en vez de =package.el=. Éste instala paquetes desde los repositorios de Git listado en ELPA Y MELPA, o desde URL Git. Para instalarlo, según se indica en su [[https://github.com/raxod502/straight.el#getting-started][web]], primero debemos inicializarlo (bootstrap):

#+begin_SRC emacs-lisp

  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

#+end_SRC

*** =use-package=

Lo primero que instalamos y configuramos es =use-package=. Más tarde lo cargaremos.

#+begin_SRC emacs-lisp

  (straight-use-package 'use-package)

  ;; Configure `use-package' prior to loading it.
  (eval-and-compile
    (setq use-package-always-ensure nil)  ; ESSENTIAL for `straight.el'
    (setq use-package-always-defer nil)
    (setq use-package-always-demand nil)
    (setq use-package-expand-minimally nil)
    (setq use-package-enable-imenu-support t)
    (setq use-package-compute-statistics nil)
    ;; The following is VERY IMPORTANT.  Write hooks using their real name
    ;; instead of a shorter version: after-init ==> `after-init-hook'.
    ;;
    ;; This is to empower help commands with their contextual awareness,
    ;; such as `describe-symbol'.
    (setq use-package-hook-name-suffix nil))
#+end_SRC

** =(provide 'early-init)=
Aquí finaliza el fichero =early-init.el=.

#+begin_src emacs-lisp
  (provide 'early-init)
  ;;; early-init.el ends here
#+end_src


* Inicio del =init.el=

#+begin_src emacs-lisp
  ;;; init.el --- Emacs main configuration file -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-
  ;;;
  ;;; Comentario:
  ;;; Configuración de Emacs de Antonio Moreno.
  ;;; Este fichero ha sido generado automáticamente con `org-babel-tangle'.
  ;;; No cambie este fichero. Fichero generador: emacs-init.org en `user-emacs-directory'
  ;;;
  ;;; Código:
#+end_src

* =use-package=

Este paquete facilita la instalación, carga y configuración de los /paquetes/ (incluyendo las librerías que vienen con Emacs). Este paquete ya debería estar instalado con =straight.el=. Solo nos queda /requerirlo/:

#+begin_SRC emacs-lisp

  (require 'use-package)

#+end_SRC

* Configuración básica

Algunas variables a mi gusto.

** Datos personales

Además de útil para la gestión del email, algunos modos pueden usar estos datos, como Org Mode.

#+begin_src emacs-lisp
  (use-package startup
    :no-require t
    ;; :straight nil
    :custom
    (user-mail-address "ammz@deversorius.net")
    (user-full-name "Antonio Moreno"))
#+end_src

** Directorio por defecto

#+begin_SRC emacs-lisp

  ;; Directorio de inicio tras C-x C-f
  (setq default-directory "~/")

#+end_SRC

** Actualiza el load-path

El directorio con el código lisp propio hay que incluirlo en el load-path.

#+begin_SRC emacs-lisp
(push "~/.emacs.d/lisp" load-path)
#+end_SRC

** Backups

Colocamos los ficheros backup en un único directorio, en vez de estar repartidos por todas partes.

#+begin_src emacs-lisp

  (use-package files
    ;; :straight nil
    :config
    (setq backup-directory-alist '(("." . "~/.emacs.d/backups/")))
    (setq create-lockfiles nil))

#+END_SRC

** Más pequeños ajustes

- Responder solo con y/n
- Seguir enlaces sin preguntar
- Respuesta más rápida mostrando las combinaciones de teclas
- Permite ciertas acciones limitadas por Emacs
- Elimina los avisos sonoros

#+begin_src emacs-lisp

  (use-package emacs
    :init
    (setq frame-title-format '("%b -  %I"))
    (setq echo-keystrokes 0.25)				; Muestra más rápido las combinaciones de teclas
    (setq auto-revert-verbose nil)				; No muestra mensaje
    (setq ring-bell-function 'ignore)			; Elimina los avisos sonoros
    :config
    (defalias 'yes-or-no-p 'y-or-n-p)		; Responder solo con y/n
    ;; Se permiten ciertas acciones limitadas por Emacs
    (put 'narrow-to-region 'disabled nil)
    (put 'upcase-region 'disabled nil)	; =C-x C-u=
    (put 'downcase-region 'disabled nil)	; =C-x C-l=
    (put 'dired-find-alternate-file 'disabled nil))

#+end_SRC

** Custom.el

Almacenamos en un fichero separado el código elisp que Emacs añade al instalar algunos paquetes o usar los interfaces de configuración.

#+begin_src emacs-lisp

  (use-package cus-edit
    ;; :straight nil
    :config
    (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
    (unless (file-exists-p custom-file)
      (make-empty-file custom-file))
    (load custom-file))

#+end_src

** Registro del histórico
*** Recentf (ficheros y directorios recientes)

Este modo realiza un seguimiento de los ficheros que teníamos abiertos, permitiendo volver a ellos rápidamente.

#+begin_src emacs-lisp

  (use-package recentf
    :config
    (setq recentf-save-file (expand-file-name "recentf" user-emacs-directory))
    (setq recentf-max-menu-items 10)
    (setq recentf-exclude '(".gz" ".xz" ".zip" "/elpa/" "/ssh:" "/sudo:"))
    :hook (after-init-hook . recentf-mode))

#+end_src

*** Minibuffer

Mantiene un registro de las acciones del minibuffer

#+begin_src emacs-lisp

  (use-package savehist
    :config
    (setq savehist-file (expand-file-name "savehist" user-emacs-directory))
    (setq savehist-save-minibuffer-history t)
    (savehist-mode 1))

#+end_src

*** Posición del cursor

Recuerda donde están los /points/ en cualquier fichero.

#+begin_src emacs-lisp

  (use-package saveplace
    :config
    (setq save-place-file (expand-file-name "saveplace" user-emacs-directory))
    (save-place-mode 1))

#+END_SRC

** Selección

Este modo elimina la región marcada cuando se inserta directamente sobre ella.

#+begin_src emacs-lisp

  (use-package delsel
    :hook (after-init-hook . delete-selection-mode))

#+end_SRC

* Mejorando la estética

** Sin pantalla de inicio

Eliminamos la pantalla de Emacs muestra cuando se inicia sin un fichero.

#+begin_SRC emacs-lisp
  (use-package startup
    :no-require t
    ;; :straight nil
    :config
    (setq inhibit-startup-screen t))
#+end_SRC


#+BEGIN_SRC emacs-lisp

  (use-package emacs
    :config
    (set-fringe-mode 10))				; Give some breathing room

#+END_SRC

