emacs/.emacs.d/init.el
;;; init.el --- Emacs main configuration file -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-
;;;
;;; Comentario:
;;; Configuración de Emacs de Antonio Moreno.
;;; Este fichero ha sido generado automáticamente con `org-babel-tangle'.
;;; No cambie este fichero. Fichero generador: emacs-init.org en `user-emacs-directory'
;;;
;;; Código:

(require 'use-package)

(use-package startup
  :no-require t
  ;; :straight nil
  :custom
  (user-mail-address "ammz@deversorius.net")
  (user-full-name "Antonio Moreno"))

;; Directorio de inicio tras C-x C-f
(setq default-directory "~/")

(push "~/.emacs.d/lisp" load-path)

(use-package files
  ;; :straight nil
  :config
  (setq backup-directory-alist '(("." . "~/.emacs.d/backups/")))
  (setq create-lockfiles nil))

(use-package emacs
  :init
  (setq frame-title-format '("%b -  %I"))
  (setq echo-keystrokes 0.25)				; Muestra más rápido las combinaciones de teclas
  (setq auto-revert-verbose nil)				; No muestra mensaje
  (setq ring-bell-function 'ignore)			; Elimina los avisos sonoros
  :config
  (defalias 'yes-or-no-p 'y-or-n-p)		; Responder solo con y/n
  ;; Se permiten ciertas acciones limitadas por Emacs
  (put 'narrow-to-region 'disabled nil)
  (put 'upcase-region 'disabled nil)	; =C-x C-u=
  (put 'downcase-region 'disabled nil)	; =C-x C-l=
  (put 'dired-find-alternate-file 'disabled nil))

(use-package cus-edit
  ;; :straight nil
  :config
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
  (unless (file-exists-p custom-file)
    (make-empty-file custom-file))
  (load custom-file))

(use-package recentf
  :config
  (setq recentf-save-file (expand-file-name "recentf" user-emacs-directory))
  (setq recentf-max-menu-items 10)
  (setq recentf-exclude '(".gz" ".xz" ".zip" "/elpa/" "/ssh:" "/sudo:"))
  :hook (after-init-hook . recentf-mode))

(use-package savehist
  :config
  (setq savehist-file (expand-file-name "savehist" user-emacs-directory))
  (setq savehist-save-minibuffer-history t)
  (savehist-mode 1))

(use-package saveplace
  :config
  (setq save-place-file (expand-file-name "saveplace" user-emacs-directory))
  (save-place-mode 1))

(use-package delsel
  :hook (after-init-hook . delete-selection-mode))

(use-package startup
  :no-require t
  ;; :straight nil
  :config
  (setq inhibit-startup-screen t))

(use-package emacs
  :config
  (set-fringe-mode 10))				; Give some breathing room

(use-package emacs
  :config
