emacs/emacs-init.org
** Cursor

Usamos el cursor tipo barra (|) en la ventana activa y el tipo hollow en las demás

#+begin_src emacs-lisp

  (use-package emacs
    :config
    (setq cursor-type 'bar)
    (setq cursor-in-non-selected-windows 'hollow)
    (setq x-stretch-cursor nil))

#+end_SRC

** Tipo de letra

#+begin_src emacs-lisp

  (use-package emacs
    :config
    ;; (set-frame-font "Hack 12" t t)
    (set-face-attribute 'default nil :font "Hack 14"))

#+end_src

** Configuración del modeline

*** Lighters

El nombre de un modo en el modeline se denomina 'lighter'. Con este paquete se puede editar, renombrar u ocultar éstos. (la información aún estará disponible ejecutando =C-h m=). Además, la funcionalidad puede integrarse en la declaración de cada paquete de =use-package=: etiqueta =:delight=.

#+begin_SRC emacs-lisp

(use-package delight
  :straight t
  :after use-package)

#+end_SRC

*** Iconos y doom-modeline

  #+begin_SRC emacs-lisp

  (use-package all-the-icons
    :straight t
    :if (display-graphic-p)
    :commands all-the-icons-install-fonts
    :init
    (unless (find-font (font-spec :name "all-the-icons"))
      (all-the-icons-install-fonts t)))

  (use-package all-the-icons-dired
    :disabled
    :straight t
    :if (display-graphic-p)
    :hook (dired-mode-hook . all-the-icons-dired-mode))

  (use-package doom-modeline
    :straight t
    :init (doom-modeline-mode 1))

  #+end_SRC

** Temas

*** Material

#+begin_SRC emacs-lisp

  (use-package material-theme
    :straight t)

  (load-theme 'material t)

#+end_SRC

*** Doom

#+begin_SRC emacs-lisp

  (use-package doom-themes
    :disabled
    :straight t)

#+end_SRC

*** COMMENT Modus

#+BEGIN_SRC emacs-lisp

  ;;versión oscura
  (use-package modus-vivendi-theme
    :straight t)

  ;;versión clara
  (use-package modus-operandi-theme
    :straight t)

  (use-package emacs
    :config
    (defun ammz/modus-operandi ()
      (load-theme 'modus-operandi t))

    (defun ammz/modus-vivendi ()
      (load-theme 'modus-vivendi t))

    (defun ammz/modus-themes-toggle ()
      "Simplistic toggle for my Modus Themes.  All it does is check
     if `modus-operandi' (light version) is active and if so switch to
     `modus-vivendi' (dark version).  Else it switches to the light
     theme."
      (interactive)
      (if (eq (car custom-enabled-themes) 'modus-operandi)
          (ammz/modus-vivendi)
        (ammz/modus-operandi)))
    :bind ("<f5>" . ammz/modus-themes-toggle)
    :hook (after-init-hook . ammz/modus-operandi))

#+end_SRC

** Números de líneas

Por defecto, activamos los números de líneas en todos los modos. No obstante, lo desactivamos en algunos como org-mode, dired y las terminales.

#+begin_SRC emacs-lisp

  (use-package display-line-numbers
    :config
    (column-number-mode)
    (setq global-display-line-numbers-mode t)
    (setq display-line-numbers-grow-only t)
    ;; Deshabilita los números de línea en algunos modos
    (dolist (mode '(org-mode-hook
                    term-mode-hook
				    dired-mode-hook
                    shell-mode-hook
                    eshell-mode-hook))
      (add-hook mode (lambda () (display-line-numbers-mode 0)))))

#+end_SRC

** Específico para OS X

Configuración del teclado en OS X

#+BEGIN_SRC emacs-lisp

  (when (eq system-type 'darwin)
    (setq ns-pop-up-frames t)
    (setq ns-function-modifier (quote super))
    (setq ns-alternate-modifier (quote meta))
    (setq ns-command-modifier (quote control))
    (setq ns-control-modifier (quote super))
    (setq ns-right-command-modifier (quote meta))
    (setq ns-right-alternate-modifier (quote none))
    ;; Esta configuración funciona con la versión de emacs (Emacs Plus):
    ;; https://github.com/d12frosted/homebrew-emacs-plus#emacs-configuration
    ;; También es necesario configurar el teclado con 'Karabiner-elements'
    (setq mac-pass-command-to-system nil)	;command-h no se gestiona por OS X
    (setq mac-command-modifier 'control)
    (setq mac-right-command-modifier 'meta)
    (setq mac-option-modifier 'meta)
    (setq mac-right-option-modifier '(:function alt :mouse alt)))

#+End_SRC

En OS X, Emacs no toma algunas variables de entorno si no se inicia desde el shell. Vamos a corregirlo.

#+BEGIN_SRC emacs-lisp

  (use-package exec-path-from-shell
    :straight t
    :if (memq window-system '(mac ns x))
    :init
    (setq exec-path-from-shell-check-startup-files nil)
    ;; Ampliamos las variables que coge por defecto
    (exec-path-from-shell-copy-envs '("LANG" "WORKON_HOME"))
    :config
    (exec-path-from-shell-initialize))

#+END_SRC

* Manejo de las ventanas

** winner: restaura la disposición de las ventanas

| C-c left  | winner-undo |
| C-c right | winner-redo |

#+begin_SRC emacs-lisp

  (use-package winner
      :config (winner-mode))

#+end_SRC

** Elimina las ventanas help

Cuando se abre una ventana con un buffer help es dificil eliminarla ya que el puntero se queda en la ventana que lo llama, prefiero cerrarla rápidamente con =q= después de consultarla.

#+begin_src emacs-lisp
  (use-package help
    :straight nil
    :custom (help-window-select t))
#+end_src

** Numeración de las ventanas

Numera las ventanas y podemos situarnos en ellas con Alt-<num>.

#+begin_src emacs-lisp

  (use-package window-numbering
    :straight t
    :config
    (window-numbering-mode))

#+end_src

* Herramientas

** Focus

#+begin_SRC emacs-lisp

  (use-package visual-fill-column
    :straight t)

  (defun ammz/org-mode-visual-fill ()
    (setq visual-fill-column-width 100
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook
    (org-mode-hook . ammz/org-mode-visual-fill)
    (ConTeXt-mode-hook . ammz/org-mode-visual-fill))

#+end_SRC

** Emacs server

Permite que =emacsclient= (con o sin =--create-frame=) comparta el proceso de ejecución de emacs. El servidor persistirá mientras exista un frame asociado a dicho servidor.

#+begin_src emacs-lisp

  (use-package server
    :hook (after-init-hook . server-start))

#+end_src

** Comentarios

#+begin_src emacs-lisp

  (use-package newcomment
    :config
    (setq comment-empty-lines t)
    (setq comment-multi-line t)
    (setq comment-style 'multi-line)
    :bind ("C-;" . comment-dwim)
    )

#+end_SRC
** Origami - Plegado de código

Origami - Does code folding, ie hide the body of an if/else/for/function so that you can fit more code on your screen

#+begin_src emacs-lisp

  (use-package origami
    :straight t
    :commands (origami-mode)
    :bind (:map origami-mode-map
                ("C-c o o" . origami-recursively-toggle-node)
                ("C-c o a" . origami-toggle-all-nodes)
                ("C-c o t" . origami-toggle-node)
                ("C-c o :" . origami-show-only-node)
                ("C-c o u" . origami-undo)
                ("C-c o U" . origami-redo)
                ("C-c o C-r" . origami-reset)
                )
    :config
    (setq origami-show-fold-header t)
    ;; The python parser currently doesn't fold if/for/etc. blocks, which is
    ;; something we want. However, the basic indentation parser does support
    ;; this with one caveat: you must toggle the node when your cursor is on
    ;; the line of the if/for/etc. statement you want to collapse. You cannot
    ;; fold the statement by toggling in the body of the if/for/etc.
    (add-to-list 'origami-parser-alist '(python-mode . origami-indent-parser))
    :init
    (add-hook 'prog-mode-hook 'origami-mode)
    )

#+end_SRC

** Dired (gestor de ficheros)
*** Configuración base

#+begin_src emacs-lisp
  (when (eq system-type 'darwin)
    (require 'ls-lisp)
    (setq insert-directory-program "/usr/local/bin/gls"))

  (use-package dired
    ;; :custom ((dired-listing-switches "-agho --group-directories-first"))
    :bind (:map dired-mode-map
                ("b" . dired-up-directory)))

#+end_SRC

*** dired-subtree (navegación tipo árbol)

#+begin_src emacs-lisp

  (use-package dired-subtree
    :straight t
    :after dired
    :bind (:map dired-mode-map
                ("<tab>" . dired-subtree-toggle)
                ("<S-tab>" . dired-subtree-remove)))

#+end_SRC
** Magit (Interfaz para Git)

#+begin_src emacs-lisp

  (use-package magit
    :straight t
    :bind (("C-c g" . magit-status)))

#+END_SRC

El siguiente paquete está configurado conforme la guía de este artículo [[https://chris.beams.io/posts/git-commit/][Writing a Git commit message]].

#+begin_src emacs-lisp

  (use-package git-commit
    :after magit
    :custom
    (git-commit-fill-column 72)
    (git-commit-summary-max-length 50)
    (git-commit-known-pseudo-headers
     '("Signed-off-by"
       "Acked-by"
       "Modified-by"
       "Cc"
       "Suggested-by"
       "Reported-by"
       "Tested-by"
       "Reviewed-by"))
    (git-commit-style-convention-checks
     '(non-empty-second-line
       overlong-summary-line)))

#+END_SRC

La siguiente configuración es para las pantallas diff que produce Magit.

#+begin_src emacs-lisp

  (use-package magit-diff
    :after magit
    :custom
    (magit-diff-refine-hunk t))

#+END_SRC
** Trabajando con buffers

Estos ajustes facilitan trabajar con múltiples buffers. Cuando tienen el mismo nombre, Emacs procurará diferenciarlos mostrando su ruta entre ángulos, mientras quita la parte que tienen en común.

Todas estas operaciones se revierten cuando un buffer se quita de la lista de afectados.

#+begin_src emacs-lisp

  (use-package uniquify
    :custom
    (uniquify-buffer-name-style 'post-forward-angle-brackets)
    (uniquify-strip-common-suffix t)
    (uniquify-after-kill-buffer-p t))

#+END_SRC

