emacs/.emacs.d/init.el
  (setq cursor-type 'bar)
  (setq cursor-in-non-selected-windows 'hollow)
  (setq x-stretch-cursor nil))

(use-package emacs
  :config
  ;; (set-frame-font "Hack 12" t t)
  (set-face-attribute 'default nil :font "Hack 12"))

(use-package delight
  :straight t
  :after use-package)

(use-package all-the-icons
  :straight t
  :if (display-graphic-p)
  :commands all-the-icons-install-fonts
  :init
  (unless (find-font (font-spec :name "all-the-icons"))
    (all-the-icons-install-fonts t)))

(use-package all-the-icons-dired
  :disabled
  :straight t
  :if (display-graphic-p)
  :hook (dired-mode-hook . all-the-icons-dired-mode))

(use-package doom-modeline
  :straight t
  :init (doom-modeline-mode 1))

(use-package material-theme
  :straight t)

(load-theme 'material t)

(use-package doom-themes
  :disabled
  :straight t)

(use-package display-line-numbers
  :config
  (column-number-mode)
  (setq global-display-line-numbers-mode t)
  (setq display-line-numbers-grow-only t)
  ;; Deshabilita los números de línea en algunos modos
  (dolist (mode '(org-mode-hook
                  term-mode-hook
				  dired-mode-hook
                  shell-mode-hook
                  eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0)))))

(when (eq system-type 'darwin)
  (setq ns-pop-up-frames t)
  (setq ns-function-modifier (quote super))
  (setq ns-alternate-modifier (quote meta))
  (setq ns-command-modifier (quote control))
  (setq ns-control-modifier (quote super))
  (setq ns-right-command-modifier (quote meta))
  (setq ns-right-alternate-modifier (quote none)))

(use-package exec-path-from-shell
  :straight t
  :if (memq window-system '(mac ns x))
  :init
  (setq exec-path-from-shell-check-startup-files nil)
  ;; Ampliamos las variables que coge por defecto
  (exec-path-from-shell-copy-envs '("LANG" "WORKON_HOME"))
  :config
  (exec-path-from-shell-initialize))

(use-package winner
    :config (winner-mode))

(use-package help
  :straight nil
  :custom (help-window-select t))

(use-package window-numbering
  :straight t
  :config
  (window-numbering-mode))

(use-package visual-fill-column
  :straight t)

(defun ammz/org-mode-visual-fill ()
  (setq visual-fill-column-width 100
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook
  (org-mode-hook . ammz/org-mode-visual-fill)
  (ConTeXt-mode-hook . ammz/org-mode-visual-fill))

(use-package server
  :hook (after-init-hook . server-start))

(use-package newcomment
  :config
  (setq comment-empty-lines t)
  (setq comment-multi-line t)
  (setq comment-style 'multi-line)
  :bind ("C-;" . comment-dwim)
  )

(use-package origami
  :straight t
  :commands (origami-mode)
  :bind (:map origami-mode-map
              ("C-c o o" . origami-recursively-toggle-node)
              ("C-c o a" . origami-toggle-all-nodes)
              ("C-c o t" . origami-toggle-node)
              ("C-c o :" . origami-show-only-node)
              ("C-c o u" . origami-undo)
              ("C-c o U" . origami-redo)
              ("C-c o C-r" . origami-reset)
              )
  :config
  (setq origami-show-fold-header t)
  ;; The python parser currently doesn't fold if/for/etc. blocks, which is
  ;; something we want. However, the basic indentation parser does support
  ;; this with one caveat: you must toggle the node when your cursor is on
  ;; the line of the if/for/etc. statement you want to collapse. You cannot
  ;; fold the statement by toggling in the body of the if/for/etc.
  (add-to-list 'origami-parser-alist '(python-mode . origami-indent-parser))
  :init
  (add-hook 'prog-mode-hook 'origami-mode)
  )

(when (eq system-type 'darwin)
  (require 'ls-lisp)
  (setq insert-directory-program "/usr/local/bin/gls"))

(use-package dired
  ;; :custom ((dired-listing-switches "-agho --group-directories-first"))
  :bind (:map dired-mode-map
              ("b" . dired-up-directory)))

(use-package dired-subtree
  :straight t
  :after dired
  :bind (:map dired-mode-map
              ("<tab>" . dired-subtree-toggle)
              ("<S-tab>" . dired-subtree-remove)))

(use-package magit
  :straight t
  :bind (("C-c g" . magit-status)))

(use-package git-commit
  :after magit
  :custom
  (git-commit-fill-column 72)
  (git-commit-summary-max-length 50)
  (git-commit-known-pseudo-headers
   '("Signed-off-by"
     "Acked-by"
     "Modified-by"
     "Cc"
     "Suggested-by"
     "Reported-by"
     "Tested-by"
     "Reviewed-by"))
  (git-commit-style-convention-checks
   '(non-empty-second-line
     overlong-summary-line)))

(use-package magit-diff
  :after magit
  :custom
  (magit-diff-refine-hunk t))

(use-package uniquify
  :custom
  (uniquify-buffer-name-style 'post-forward-angle-brackets)
  (uniquify-strip-common-suffix t)
  (uniquify-after-kill-buffer-p t))
