emacs/emacs-init.org
*** Configuración de ibuffer

#+begin_src emacs-lisp

  (use-package ibuffer
    :custom
    (ibuffer-expert t)
    (ibuffer-display-summary nil)
    (ibuffer-use-other-window nil)
    (ibuffer-show-empty-filter-groups nil)
    (ibuffer-movement-cycle nil)
    (ibuffer-default-sorting-mode 'filename/process)
    ;;;; NOTE built into the Modus themes
    ;; (ibuffer-deletion-face 'dired-flagged)
    ;; (ibuffer-marked-face 'dired-marked)
    (ibuffer-saved-filter-groups
     '(("Main"
        ("Directories" (mode . dired-mode))
        ("Org" (mode . org-mode))
        ("Programming" (or
                        (mode . c-mode)
                        (mode . conf-mode)
                        (mode . css-mode)
                        (mode . emacs-lisp-mode)
                        (mode . html-mode)
                        (mode . mhtml-mode)
                        (mode . python-mode)
                        (mode . ruby-mode)
                        (mode . scss-mode)
                        (mode . shell-script-mode)
                        (mode . yaml-mode)))
        ("Markdown" (mode . markdown-mode))
        ("Magit" (or
                  (mode . magit-blame-mode)
                  (mode . magit-cherry-mode)
                  (mode . magit-diff-mode)
                  (mode . magit-log-mode)
                  (mode . magit-process-mode)
                  (mode . magit-status-mode)))
        ("Apps" (or
                     (mode . bongo-playlist-mode)
                     (mode . mu4e-compose-mode)
                     (mode . mu4e-headers-mode)
                     (mode . mu4e-main-mode)
                     (mode . elfeed-search-mode)
                     (mode . elfeed-show-mode)
                     (mode . mu4e-view-mode)))
         ("Emacs" (or
                   (name . "^\\*Help\\*$")
                   (name . "^\\*Custom.*")
                   (name . "^\\*Org Agenda\\*$")
                   (name . "^\\*info\\*$")
                   (name . "^\\*scratch\\*$")
                   (name . "^\\*Backtrace\\*$")
                   (name . "^\\*Messages\\*$"))))))
    :config
    (defun prot/ibuffer-multi ()
      "Spawn a new instance of `ibuffer' and give it a unique name
  based on the directory of the current buffer."
      (interactive)
      (let* ((parent (if (buffer-file-name)
                         (file-name-directory (buffer-file-name))
                       default-directory))
             (name (car (last (split-string parent "/" t)))))
        (split-window-sensibly)
        (other-window 1)
        (ibuffer t "*Ibuffer [new]*")
        (rename-buffer (concat "*Ibuffer: " name "*"))))
    :hook
    (ibuffer-mode-hook . (lambda ()
                       (ibuffer-switch-to-saved-filter-groups "Main")))
    :bind (("C-x C-b" . ibuffer)
           ("C-x C-S-b" . prot/ibuffer-multi) ; EXPERIMENTAL
           ))

#+END_SRC

** Emacs "desktop"

Guarda el estado en el que estaba Emacs: nombre, posición de los buffers y similares.

#+begin_src emacs-lisp

  (use-package desktop
    :disabled
    :config
    (setq desktop-dirname user-emacs-directory)
    (setq desktop-base-file-name "desktop")
    (setq desktop-missing-file-warning t)
    (setq desktop-restore-eager 3)
    :hook (after-init-hook . (lambda () (desktop-save-mode 1))))

  #+end_src

** Atajos de teclado imprescindibles

#+begin_src emacs-lisp

  (use-package emacs
      :bind
      (("C-." . repeat)
       ("<C-tab>" . other-window)			; ATENCION: No válido en mac
       ("C-ñ" . other-window)
       ;; ("M-}" . "}")
       ;; ("M-+" . "]")
       ))

#+END_SRC

* exwm: configuración de emacs como window manager

Carga la configuración del Escritorio así como el gestor de ventanas (EXWM) si éste es soportado por el sistema operativo y, además, se pasa el argumento =--use-exwm= en el arranque de Emacs. El código del gestor de ventanas (EXWM) se enecuentra en exwm.org.

#+begin_src emacs-lisp

  (setq ammz/exwm-enabled (and (eq window-system 'x) ; Sólo sistemas con X Window
                             (seq-contains command-line-args "--use-exwm")))

  (when ammz/exwm-enabled
    (require 'ammz-exwm))

#+end_src

** COMMENT Basic configuration

#+begin_SRC emacs-lisp

  (use-package exwm
    :straight t)

  (require 'exwm)
  (require 'exwm-config)

  ;; Set the initial workspace number.
  (setq exwm-workspace-number 5)

  ;; Make class name the buffer name
  (add-hook 'exwm-update-class-hook
            (lambda ()
              (exwm-workspace-rename-buffer exwm-class-name)))

#+end_SRC

** COMMENT Global keys

#+begin_SRC emacs-lisp

  (unless (get 'exwm-input-global-keys 'saved-value)
    (setq exwm-input-global-keys
          '(([?\s-&] . (lambda (command)
                         (interactive (list (read-shell-command "$ ")))
                         (start-process-shell-command command nil command)))

            ;; 's-r': Reset (to line-mode).
            ([?\s-r] . exwm-reset)

            ;; managing workspaces
            ([?\s-w] . exwm-workspace-switch)
            ([?\s-W] . exwm-workspace-swap)
            ([?\s-\C-w] . exwm-workspace-move)

            ;; reset exwm
            ([?\s-r] . exwm-reset)

            ;; managing windows
            ([s-left] . windmove-left)
            ([s-right] . windmove-right)
            ([s-up] . windmove-up)
            ([s-down] . windmove-down)

            ;; swaping windows
            ([s-S-left] . windmove-swap-states-left)
            ([s-S-right] . windmove-swap-states-right)
            ([s-S-up] . windmove-swap-states-up)
            ([s-S-down] . windmove-swap-states-down)

            ;; managing window sizes
            ([s-M-left] . enlarge-window-horizontally)
            ([s-M-right] . shrink-window-horizontally)
            ([s-M-up] . shrink-window)
            ([s-M-down] . enlarge-window)

            ;; Focus window
            ([?\s- ] . other-window)
            ([?\s-1] . select-window-1)
            ([?\s-2] . select-window-2)
            ([?\s-3] . select-window-3)
            ([?\s-4] . select-window-4)
            ([?\s-5] . select-window-5)
            ([?\s-6] . select-window-6)
            ([?\s-7] . select-window-7)
            ([?\s-8] . select-window-8)
            ([s-f11] . ammz/go-previous-workspace)
            ([s-f12] . ammz/go-next-workspace)

            ;; programs
            ([?\s-d] . dmenu)

            ;; Controles de audio
            ([XF86AudioMute] . (lambda () (interactive) (start-process-shell-command "Mute" nil "amixer -q set Master toggle")))
            ([XF86AudioLowerVolume] . (lambda () (interactive) (start-process-shell-command "Decrease" nil "amixer -q set Master 5%-")))
            ([XF86AudioRaiseVolume] . (lambda () (interactive) (start-process-shell-command "Increase" nil "amixer -q set Master 5%+")))
            ([XF86AudioPlay] . (lambda () (interactive) (start-process-shell-command "Play" nil "playerctl play-pause")))
            ([XF86AudioNext] . (lambda () (interactive) (start-process-shell-command "Next" nil "playerctl next")))
            ([XF86AudioPrev] . (lambda () (interactive) (start-process-shell-command "Previous" nil "playerctl previous")))
            ([XF86AudioStop] . (lambda () (interactive) (start-process-shell-command "Stop" nil "playerctl stop")))
            )))

#+end_SRC

** COMMENT Simulation keys

  #+begin_SRC emacs-lisp

  (unless (get 'exwm-input-simulation-keys 'saved-value)
    (setq exwm-input-simulation-keys
          '(([?\C-b] . [left])
            ([?\C-f] . [right])
            ([?\C-p] . [up])
            ([?\C-n] . [down])
            ([?\C-a] . [home])
            ([?\C-e] . [end])
            ([?\M-v] . [prior])
            ([?\C-v] . [next])
            ([?\C-d] . [delete])
            ([?\C-k] . [S-end delete]))))

  #+end_SRC

** COMMENT systemtray

  #+begin_SRC emacs-lisp

  ;; systemtray
  ;; (require 'exwm-systemtray)
  ;; (exwm-systemtray-enable)

  #+end_SRC

** COMMENT Multi-monitors

  #+begin_SRC emacs-lisp

  ;; multi-monitors
  (require 'exwm-randr)
  (setq exwm-randr-workspace-output-plist '(0 "eDP1" 1 "HDMI1"))
  (add-hook 'exwm-randr-screen-change-hook
            (lambda ()
              (start-process-shell-command
               "xrandr" nil "xrandr --output eDP1 --off --output HDMI1 --auto")))
  (exwm-randr-enable)

  #+end_SRC

** COMMENT Enable EXWM

  #+begin_SRC emacs-lisp

  ;; Enable EXWM
  (exwm-enable)

  #+end_SRC

** COMMENT Configure Ido

  #+begin_SRC emacs-lisp

    (require 'ido)

    (defun exwm-config--fix/ido-buffer-window-other-frame ()
      "Fix `ido-buffer-window-other-frame'."
      (defalias 'exwm-config-ido-buffer-window-other-frame
        (symbol-function #'ido-buffer-window-other-frame))
      (defun ido-buffer-window-other-frame (buffer)
        "This is a version redefined by EXWM.

      You can find the original one at `exwm-config-ido-buffer-window-other-frame'."
        (with-current-buffer (window-buffer (selected-window))
          (if (and (derived-mode-p 'exwm-mode)
                   exwm--floating-frame)
              ;; Switch from a floating frame.
              (with-current-buffer buffer
                (if (and (derived-mode-p 'exwm-mode)
                         exwm--floating-frame
                         (eq exwm--frame exwm-workspace--current))
                    ;; Switch to another floating frame.
                    (frame-root-window exwm--floating-frame)
                  ;; Do not switch if the buffer is not on the current workspace.
                  (or (get-buffer-window buffer exwm-workspace--current)
                      (selected-window))))
            (with-current-buffer buffer
              (when (derived-mode-p 'exwm-mode)
                (if (eq exwm--frame exwm-workspace--current)
                    (when exwm--floating-frame
                      ;; Switch to a floating frame on the current workspace.
                      (frame-selected-window exwm--floating-frame))
                  ;; Do not switch to exwm-mode buffers on other workspace (which
                  ;; won't work unless `exwm-layout-show-all-buffers' is set)
                  (unless exwm-layout-show-all-buffers
                    (selected-window)))))))))

    (defun exwm-config-ido ()
      "Configure Ido to work with EXWM."
      (ido-mode 1)
      (add-hook 'exwm-init-hook #'exwm-config--fix/ido-buffer-window-other-frame))

    ;; Configure Ido
    (exwm-config-ido)

  #+end_SRC

** COMMENT Polybar

  #+begin_SRC emacs-lisp

  ;; Polybar
  (defvar ammz/polybar-process nil
    "Guarda el proceso de la instancia Polybar, si existe")

  (defun ammz/kill-panel ()
    (interactive)
    (when ammz/polybar-process
      (ignore-errors
        (kill-process ammz/polybar-process)))
    (setq ammz/polybar-process nil))

  (defun ammz/start-panel ()
    (interactive)
    (ammz/kill-panel)
    (setq ammz/polybar-process (start-process-shell-command "polybar" nil "polybar --reload mainbar-exwm -c ~/.config/polybar/config")))

  (ammz/start-panel)

  #+end_SRC

** COMMENT Selección workspace

  #+begin_SRC emacs-lisp

  (defun ammz/go-next-workspace ()
    "Cambia al siguiente workspace o reinicia desde el 0"
    (interactive)
    (let* ((ws (exwm-workspace--position (selected-frame)))
           (ultimo (- (exwm-workspace--count) 1)))
      (if (< ws ultimo)
          (exwm-workspace-switch (+ ws 1))
        (exwm-workspace-switch 0))

      (if (equal ws ultimo)
          (message "Estamos en el workspace 0")
        (message "Estamos en el workspace %d" (+ ws 1)))))

  (defun ammz/go-previous-workspace ()
    "Cambia al anterior workspace o reinicia desde el último"
    (interactive)
    (let* ((ws (exwm-workspace--position (selected-frame)))
           (ultimo (- (exwm-workspace--count) 1)))
      (if (> ws 0)
          (exwm-workspace-switch (- ws 1))
        (exwm-workspace-switch ultimo))
      (if (equal ws 0)
          (message "Estamos en el workspace %d" ultimo)
      (message "Estamos en el workspace %d" (- ws 1)))))

  #+end_SRC

** COMMENT dmenu

#+begin_SRC emacs-lisp

    (use-package dmenu
      :straight t)

#+end_SRC

* Métodos de búsqueda

