emacs/.emacs.d/init.el

(use-package ibuffer
  :custom
  (ibuffer-expert t)
  (ibuffer-display-summary nil)
  (ibuffer-use-other-window nil)
  (ibuffer-show-empty-filter-groups nil)
  (ibuffer-movement-cycle nil)
  (ibuffer-default-sorting-mode 'filename/process)
  ;;;; NOTE built into the Modus themes
  ;; (ibuffer-deletion-face 'dired-flagged)
  ;; (ibuffer-marked-face 'dired-marked)
  (ibuffer-saved-filter-groups
   '(("Main"
      ("Directories" (mode . dired-mode))
      ("Org" (mode . org-mode))
      ("Programming" (or
                      (mode . c-mode)
                      (mode . conf-mode)
                      (mode . css-mode)
                      (mode . emacs-lisp-mode)
                      (mode . html-mode)
                      (mode . mhtml-mode)
                      (mode . python-mode)
                      (mode . ruby-mode)
                      (mode . scss-mode)
                      (mode . shell-script-mode)
                      (mode . yaml-mode)))
      ("Markdown" (mode . markdown-mode))
      ("Magit" (or
                (mode . magit-blame-mode)
                (mode . magit-cherry-mode)
                (mode . magit-diff-mode)
                (mode . magit-log-mode)
                (mode . magit-process-mode)
                (mode . magit-status-mode)))
      ("Apps" (or
                   (mode . bongo-playlist-mode)
                   (mode . mu4e-compose-mode)
                   (mode . mu4e-headers-mode)
                   (mode . mu4e-main-mode)
                   (mode . elfeed-search-mode)
                   (mode . elfeed-show-mode)
                   (mode . mu4e-view-mode)))
       ("Emacs" (or
                 (name . "^\\*Help\\*$")
                 (name . "^\\*Custom.*")
                 (name . "^\\*Org Agenda\\*$")
                 (name . "^\\*info\\*$")
                 (name . "^\\*scratch\\*$")
                 (name . "^\\*Backtrace\\*$")
                 (name . "^\\*Messages\\*$"))))))
  :config
  (defun prot/ibuffer-multi ()
    "Spawn a new instance of `ibuffer' and give it a unique name
based on the directory of the current buffer."
    (interactive)
    (let* ((parent (if (buffer-file-name)
                       (file-name-directory (buffer-file-name))
                     default-directory))
           (name (car (last (split-string parent "/" t)))))
      (split-window-sensibly)
      (other-window 1)
      (ibuffer t "*Ibuffer [new]*")
      (rename-buffer (concat "*Ibuffer: " name "*"))))
  :hook
  (ibuffer-mode-hook . (lambda ()
                     (ibuffer-switch-to-saved-filter-groups "Main")))
  :bind (("C-x C-b" . ibuffer)
         ("C-x C-S-b" . prot/ibuffer-multi) ; EXPERIMENTAL
         ))

(use-package desktop
  :disabled
  :config
  (setq desktop-dirname user-emacs-directory)
  (setq desktop-base-file-name "desktop")
  (setq desktop-missing-file-warning t)
  (setq desktop-restore-eager 3)
  :hook (after-init-hook . (lambda () (desktop-save-mode 1))))

(use-package emacs
    :bind
    (("C-." . repeat)
     ("<C-tab>" . other-window)			; ATENCION: No válido en mac
     ("C-ñ" . other-window)
     ;; ("M-}" . "}")
     ;; ("M-+" . "]")
     ))

(setq ammz/exwm-enabled (and (eq window-system 'x) ; Sólo sistemas con X Window
                           (seq-contains command-line-args "--use-exwm")))

(when ammz/exwm-enabled
  (require 'ammz-exwm))
