emacs/emacs-init.org
** Orderless

#+begin_SRC emacs-lisp
  (use-package orderless
    :straight t
    :demand
    :config
    (setq orderless-component-separator " +")
    ;; (setq orderless-matching-styles prot-orderless-default-styles)
    ;; (setq orderless-style-dispatchers
    ;;       '(prot-orderless-literal-dispatcher
    ;;         prot-orderless-initialism-dispatcher))
    ;; SPC should never complete: use it for `orderless' groups.
    :bind (:map minibuffer-local-completion-map
                ("SPC" . nil)))
#+end_SRC

** Marginalia

#+begin_src emacs-lisp
(use-package marginalia
  :straight t
  :demand
  :config
  (setq marginalia-annotators
        '(marginalia-annotators-heavy
          marginalia-annotators-light))
  (marginalia-mode 1))
#+end_src

** Minibuffer

#+begin_SRC emacs-lisp
(use-package minibuffer
  :demand
  :config
  (setq completion-styles '(orderless partial-completion))
  (setq completion-category-defaults nil)
  (setq completion-cycle-threshold 3)
  (setq completion-flex-nospace nil)
  (setq completion-pcm-complete-word-inserts-delimiters t)
  (setq completion-pcm-word-delimiters "-_./:| ")
  (setq completion-show-help nil)
  (setq completion-ignore-case t)
  (setq-default case-fold-search t)   ; For general regexp

  (setq completions-format 'vertical)

  (setq read-buffer-completion-ignore-case t)
  (setq read-file-name-completion-ignore-case t)

  (setq enable-recursive-minibuffers t)
  (setq read-answer-short t)
  (setq resize-mini-windows t)
  (setq minibuffer-eldef-shorten-default t)

  (file-name-shadow-mode 1)
  (minibuffer-depth-indicate-mode 1)
  (minibuffer-electric-default-mode 1)

  ;; Defines, among others, aliases for common minibuffer commands to
  ;; Super-KEY.  Normally these should go in individual package
  ;; declarations, but their grouping here makes things easier to
  ;; understand.  Besides, they are related to the minibuffer.
  :bind (("s-b" . switch-to-buffer)
         ("s-B" . switch-to-buffer-other-window)
         ("s-f" . find-file)
         ("s-F" . find-file-other-window)
         ("s-d" . dired)
         ("s-D" . dired-other-window)
         :map completion-list-mode-map
         ("n" . next-line)
         ("p" . previous-line)
         ("f" . next-completion)
         ("b" . previous-completion)))
#+end_SRC

** Embark

#+begin_SRC emacs-lisp
  (use-package embark
    :straight t
    :demand
    :diminish embark-collect-zebra-minor-mode
    :config
    (setq embark-collect-initial-view-alist
          '((file . list)
            (buffer . list)
            (symbol . list)
            (line . list)
            (xref-location . list)
            (kill-ring . zebra)
            (t . list)))
    (setq embark-collect-live-update-delay 0.25)
    (setq embark-collect-live-initial-delay 0.5)

    ;; Please don't read too much into the names of those faces.  Just
    ;; green and yellow.
    (setq embark-action-indicator (propertize "Act" 'face 'success))
    (setq embark-become-indicator (propertize "Become" 'face 'warning))

    ;; ;; NOTE: I keep this around for when I do videos, otherwise I do not
    ;; ;; use it.
    (setq embark-action-indicator
          (lambda (map)
            (which-key--show-keymap "Embark" map nil nil 'no-paging)
            #'which-key--hide-popup-ignore-command)
          embark-become-indicator embark-action-indicator)
    :hook ((minibuffer-setup-hook . embark-collect-completions-after-input)
           (embark-post-action-hook . embark-collect--update-linked)
           (embark-collect-mode-hook . hl-line-mode))
    :bind (("C-," . embark-act)
           :map minibuffer-local-completion-map
           ("C-," . embark-act)
           ("C-." . embark-act-noexit)
           ("C->" . embark-become)
           ("M-q" . embark-collect-toggle-view) ; parallel of `fill-paragraph'
           ;; NOTE: to switch to the live collection buffer, I use
           ;; `prot-minibuffer-focus-mini-or-completions' which is bound
           ;; to "s-v".
           :map embark-collect-mode-map
           ("," . embark-act)
           ("." . embark-act-noexit)
           ("M-o" . embark-export)
           ("C-o" . embark-export)
           ("M-t" . toggle-truncate-lines)
           ("M-q" . embark-collect-toggle-view)
           :map embark-symbol-map
           ("." . embark-find-definition)
           ("k" . describe-keymap)))
#+end_SRC

** Consult

#+begin_SRC emacs-lisp
(use-package consult
  :straight t
  :demand
  :config
  (setq consult-line-numbers-widen t)
  (setq completion-in-region-function #'consult-completion-in-region)
  (setq consult-async-input-debounce 0.5)
  (setq consult-async-input-throttle 0.8)
  (setq consult-narrow-key ">")
  (setq consult-widen-key "<")
  :bind (("M-X" . consult-mode-command)
         ("M-s m" . consult-mark)
         :map consult-narrow-map
         ("?" . consult-narrow-help)
         :map minibuffer-local-completion-map
         ("<tab>" . minibuffer-force-complete)))
#+end_SRC

** Dabbrev

#+begin_src emacs-lisp
(use-package dabbrev
  :after minibuffer ; read those as well
  :config
  (setq dabbrev-abbrev-char-regexp "\\sw\\|\\s_")
  (setq dabbrev-abbrev-skip-leading-regexp "[$*/=']")
  (setq dabbrev-backward-only nil)
  (setq dabbrev-case-distinction 'case-replace)
  (setq dabbrev-case-fold-search t)
  (setq dabbrev-case-replace 'case-replace)
  (setq dabbrev-check-other-buffers t)
  (setq dabbrev-eliminate-newlines t)
  (setq dabbrev-upcase-means-case-search t)

  ;; FIXME: this is not reliable
  (defun prot/dabbrev-completion ()
    "Expand current phrase or call `dabbrev-completion'."
    (interactive)
    (let* ((abbrev (dabbrev--abbrev-at-point))
           (ignore-case-p (dabbrev--ignore-case-p abbrev))
           (completion-list (dabbrev--find-all-expansions abbrev ignore-case-p)))
      (cond
       ((when (and (eq completion-list nil)
                   (not (eq last-repeatable-command 'mode-exit)))
          (insert " ")
          (dabbrev-expand 1)))
       (t
        (dabbrev-completion)))))

  :bind (("M-/" . dabbrev-expand)
         ("C-M-/" . prot/dabbrev-completion)
         ("s-/" . prot/dabbrev-completion)))
#+end_src

** Avy

Permite mover el punto a cualquier posición en Emacs usando pocas teclas (C-c s).

#+begin_src emacs-lisp

  (use-package avy
    :straight t
    :bind
    ("C-c s" . avy-goto-char))

#+END_SRC

* Relativo a los lenguajes
