emacs/emacs-init.org
** Org-mode

#+begin_src emacs-lisp
  (use-package org
    :straight org-plus-contrib
    :config
    (setq org-startup-indented t)
    (setq org-attach-use-inheritance t)
    (setq org-list-allow-alphabetical t)

    ;; -------------------------------------------------------------------
    ;; agenda
    ;; -------------------------------------------------------------------
    (setq org-agenda-files '("~/Sync/org" "~/Sync/org/etea"))

    ;; agenda en la ventana actual
    (setq org-agenda-window-setup 'current-window)
    ;; avisa de tareas deadline en los próximos 7 días
    (setq org-deadline-warning-days 7)
    ;; muestra tareas scheduled o deadline en los próximos 10 días
    (setq org-agenda-span 10)
    ;; no muestra tareas scheduled si ya tienen fecha deadline
    (setq org-agenda-skip-deadline-if-deadlline-is-shown t)
    ;; no colorea tareas con deadline inminente si ya son scheduled
    (setq org-agenda-skip-deadline-prewarning-if-scheduled 'pre-scheduled)
    ;; no muestra tareas con fecha. implica que también ignora tareas
    ;; scheduled y deadlines
    (setq org-agenda-todo-ignore-with-date t)

    ;; -------------------------------------------------------------------
    ;; capture, refile, todo
    ;; -------------------------------------------------------------------
    (setq org-capture-templates
          '(("o" "TODO vencimiento" entry
             (file+headline "~/Sync/org/inbox.org" "tareas")
             "* TODO %?\nDEADLINE: %^{fecha tope}t")
            ("t" "TODO" entry
             (file+headline "~/Sync/org/inbox.org" "tareas")
             "* TODO %?\n")
            ("n" "Nota" entry
             (file+headline "~/Sync/org/inbox.org" "notas")
             "* %?\n%c")
            ("h" "Nota alerta" entry
             (file+headline "~/proyectos/hugo-sge/content-org/pie.org" "notas de alerta")
             (function org-hugo-new-subtree-post-capture-template)
             :prepend t)
            ("r" "Recordatorio" entry
             (file "~/Sync/org/recuerda.org")
             "* %?\n %^t")
            ("d" "Diario" entry
             (file+olp+datetree "~/Sync/org/diario.org")
             "** %?" :time-prompt t)
            ("R" "Reunion" entry
             (file+headline "~/Sync/org/inbox.org" "reuniones")
             "* TODO %? :reunion:\n%^t %^{lugar}p")
            ("i" "Informe" entry
             (file+headline "~/Sync/org/informes.org" "2019")
             "* TODO %? %^g\n:PROPERTIES:\n
                             :solicitante: %^{solicitante|sge|sgt|vice}\n
                             :f_entrada: %^u\n
                             :f_respuesta: \n:end:\n")))

    ;; Scanea los target de refile en los archivos de la agenda. Aumenta
    ;; los niveles en los que encontrar posibles encabezamientos para
    ;; reasignar tareas. Por defecto son sólo 3.
    (setq org-refile-targets (quote ((nil :maxlevel . 6)
                                     (org-agenda-files :maxlevel . 6))))

    ;; Establece como archivar los ficheros org
    (setq org-archive-location "archivador/%s_archive::")

    (setq org-todo-keywords
          '((sequence "TODO" "NEXT" "WAITING" "|" "DONE" "CANCEL")))

    ;; -------------------------------------------------------------------
    ;; exportar
    ;; -------------------------------------------------------------------
    (setq org-export-default-language "es")
    (setq org-export-date-timestamp-format "%d de %b %y")

    ;; -------------------------------------------------------------------
    ;; icalendar
    ;; -------------------------------------------------------------------
    (setq org-icalendar-combined-agenda-file "/library/webserver/documents/org.ics")
    (setq org-icalendar-store-uid t)
    (setq org-icalendar-include-todo t)
    (setq org-icalendar-use-deadline '(event-if-todo))
    (setq org-icalendar-use-scheduled '(event-if-todo))

    ;; -------------------------------------------------------------------
    ;; latex
    ;; -------------------------------------------------------------------
    (setq org-latex-pdf-process '("latexmk -lualatex"))
    (setq org-latex-packages-alist
          '(("auto" "polyglossia" t ("xelatex" "lualatex"))
            ("" "fontspec" nil ("xelatex" "lualatex"))
            ("" "unicode-math" nil ("xelatex" "lualatex"))))
    (setq org-latex-clasess
          '(("article" "\\documentclass[12pt,a4paper]{article}"
             ("\\section{%s}" . "\\section*{%s}")
             ("\\subsection{%s}" . "\\subsection*{%s}")
             ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
             ("\\paragraph{%s}" . "\\paragraph*{%s}")
             ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))
            ("report" "\\documentclass[12pt,a4paper]{report}"
             ("\\part{%s}" . "\\part*{%s}")
             ("\\chapter{%s}" . "\\chapter*{%s}")
             ("\\section{%s}" . "\\section*{%s}")
             ("\\subsection{%s}" . "\\subsection*{%s}")
             ("\\subsubsection{%s}" . "\\subsubsection*{%s}"))
            ("book" "\\documentclass[12pt,a4paper]{book}"
             ;; ("\\part{%s}" . "\\part*{%s}")
             ("\\chapter{%s}" . "\\chapter*{%s}")
             ("\\section{%s}" . "\\section*{%s}")
             ("\\subsection{%s}" . "\\subsection*{%s}")
             ("\\subsubsection{%s}" . "\\subsubsection*{%s}"))))

    ;; -------------------------------------------------------------------
    ;; codigo
    ;; -------------------------------------------------------------------
    ;; Ejecuta bloques de código sin pedir confirmación
    (setq org-confirm-babel-evaluate nil)
    ;; Ejecuta los bloques de código al salvar el archivo
    (add-hook 'after-save-hook 'org-babel-tangle)

    ;; -------------------------------------------------------------------
    ;; general
    ;; -------------------------------------------------------------------
    (setq org-structure-template-alist
          '(("s" . "SRC")
            ("e" . "SRC emacs-lisp")
            ("E" . "EXAMPLE")
            ("q" . "QUOTE")
            ("v" . "VERSE")
            ("V" . "VERBATIM")
            ("c" . "CENTER")
            ("C" . "COMMENT")))

    (setq org-ellipsis " »")

    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (python . t)
       (shell . t)
       (R . t)
       (calc . t)
       (gnuplot . t)
       (haskell . t)
       (latex . t)
       (org . t)
       (js . t)
       (java . t)
       (makefile . t)
       (C . t)))

    ;; -------------------------------------------------------------------
    ;; org link
    ;; -------------------------------------------------------------------
    (add-to-list 'org-file-apps '("\\.odt?\\'" . "open %s"))
    (add-to-list 'org-file-apps '("\\.ods?\\'" . "open %s"))
    (add-to-list 'org-file-apps '("\\.docx?\\'" . "open %s"))

    ;; añade un tipo de link para que emacs abra el fichero en Curio
    (defun open-curio (path)
      (shell-command (concat "open -a /Applications/Curio.app '" path "'")))
    (org-add-link-type "curio" 'open-curio)

    :bind
    (("C-c a" . org-agenda)
     ("C-c c" . org-capture)
     ("C-c b" . org-switchb)
     ("C-c t" . org-toggle-link-display)
     ("C-c l" . org-store-link))

    :hook
    ((org-mode-hook . (lambda () (visual-line-mode)))
     (org-mode-hook . (lambda () (scroll-bar-mode -1)))))


  (use-package org-mac-link
    :after org
    :hook
    (org-mode-hook . (lambda ()
                       (define-key org-mode-map
                         (kbd "C-c g") 'org-mac-grab-link))))

  (use-package ob-async
    :straight t)

  (use-package org-tempo
    :after org)

  (require 'org-inlinetask)

  ;; Permite utilizar la etiqueta 'ignore' para evitar exportar
  ;; el encabezado pero no el contenido
  (require 'ox-extra)
  (ox-extras-activate '(ignore-headlines))

  ;; Permite que las exportaciones se guarden en directorios diferentes
  ;; (export_html, export_odt, etc) según el tipo de fichero a obtener
  (defvar org-export-output-directory-prefix
    "export_" "prefix of directory used for org-mode export")

  (defadvice org-export-output-file-name (before org-add-export-dir activate)
    "Modifies org-export to place exported files in a different directory"
    (when (not pub-dir)
      (setq pub-dir (concat org-export-output-directory-prefix (substring extension 1)))
      (when (not (file-directory-p pub-dir))
        (make-directory pub-dir))))

  ;; El nombre el fichero exportado incorpora la fecha de exportación
  (defun modi/org-advice-prefix-export-file-name-with-date (orig-fun &rest args)
    "Prefix the output file name with current date."
    (let* ((date-format "%Y-%m-%d")       ;Customize this variable as you like
           (date-file-separator "-")      ;Customize this variable as you like
           (orig-output-file-name (apply orig-fun args))
           (orig-output-dir (file-name-directory orig-output-file-name))
           (orig-output-just-file-name (file-name-nondirectory orig-output-file-name))
           (date (format-time-string date-format (current-time))))
      (concat orig-output-dir date date-file-separator orig-output-just-file-name)))
  (advice-add 'org-export-output-file-name :around #'modi/org-advice-prefix-export-file-name-with-date)
#+END_SRC

