emacs/.emacs.d/init.el
  :straight org-plus-contrib
  :config
  (setq org-startup-indented t)
  (setq org-attach-use-inheritance t)
  (setq org-list-allow-alphabetical t)

  ;; -------------------------------------------------------------------
  ;; agenda
  ;; -------------------------------------------------------------------
  (setq org-agenda-files '("~/Sync/org" "~/Sync/org/etea"))

  ;; agenda en la ventana actual
  (setq org-agenda-window-setup 'current-window)
  ;; avisa de tareas deadline en los próximos 7 días
  (setq org-deadline-warning-days 7)
  ;; muestra tareas scheduled o deadline en los próximos 10 días
  (setq org-agenda-span 10)
  ;; no muestra tareas scheduled si ya tienen fecha deadline
  (setq org-agenda-skip-deadline-if-deadlline-is-shown t)
  ;; no colorea tareas con deadline inminente si ya son scheduled
  (setq org-agenda-skip-deadline-prewarning-if-scheduled 'pre-scheduled)
  ;; no muestra tareas con fecha. implica que también ignora tareas
  ;; scheduled y deadlines
  (setq org-agenda-todo-ignore-with-date t)

  ;; -------------------------------------------------------------------
  ;; capture, refile, todo
  ;; -------------------------------------------------------------------
  (setq org-capture-templates
   '(("o" "TODO vencimiento" entry
      (file+headline "~/Sync/org/inbox.org" "tareas")
      "* TODO %?\ndeadline: %^{fecha tope}t")
     ("t" "TODO" entry
      (file+headline "~/Sync/org/inbox.org" "tareas")
      "* TODO %?\n")
     ("n" "nota" entry
      (file+headline "~/Sync/org/inbox.org" "notas")
      "* %?\n%c")
     ("h" "nota alerta" entry
      (file+headline "~/proyectos/hugo-sge/content-org/pie.org" "notas de alerta")
      (function org-hugo-new-subtree-post-capture-template)
      :prepend t)
     ("r" "recordatorio" entry
      (file "~/Sync/org/recuerda.org")
      "* %?\n %^t")
     ("d" "diario" entry
      (file+olp+datetree "~/Sync/org/diario.org")
      "** %?" :time-prompt t)
     ("r" "reunion" entry
      (file+headline "~/Sync/org/inbox.org" "reuniones")
      "* TODO %? :reunion:\n%^t %^{lugar}p")
     ("i" "informe" entry
      (file+headline "~/Sync/org/informes.org" "2019")
      "* TODO %? %^g\n:properties:\n
                          :solicitante: %^{solicitante|sge|sgt|vice}\n
                          :f_entrada: %^u\n
                          :f_respuesta: \n:end:\n")))

  ;; Scanea los target de refile en los archivos de la agenda. Aumenta
  ;; los niveles en los que encontrar posibles encabezamientos para
  ;; reasignar tareas. Por defecto son sólo 3.
  (setq org-refile-targets (quote ((nil :maxlevel . 6)
                                   (org-agenda-files :maxlevel . 6))))

  ;; Establece como archivar los ficheros org
  (setq org-archive-location "archivador/%s_archive::")

  (setq org-todo-keywords
        '((sequence "TODO" "NEXT" "WAITING" "|" "DONE" "CANCEL")))

  ;; -------------------------------------------------------------------
  ;; exportar
  ;; -------------------------------------------------------------------
  (setq org-export-default-language "es")
  (setq org-export-date-timestamp-format "%d de %b %y")

  ;; -------------------------------------------------------------------
  ;; icalendar
  ;; -------------------------------------------------------------------
  (setq org-icalendar-combined-agenda-file "/library/webserver/documents/org.ics")
  (setq org-icalendar-store-uid t)
  (setq org-icalendar-include-todo t)
  (setq org-icalendar-use-deadline '(event-if-todo))
  (setq org-icalendar-use-scheduled '(event-if-todo))

  ;; -------------------------------------------------------------------
  ;; latex
  ;; -------------------------------------------------------------------
  (setq org-latex-pdf-process '("latexmk -lualatex"))
  (setq org-latex-packages-alist
   '(("auto" "polyglossia" t ("xelatex" "lualatex"))
     ("" "fontspec" nil ("xelatex" "lualatex"))
     ("" "unicode-math" nil ("xelatex" "lualatex"))))
  (setq org-latex-clasess
   '(("article" "\\documentclass[12pt,a4paper]{article}"
      ("\\section{%s}" . "\\section*{%s}")
      ("\\subsection{%s}" . "\\subsection*{%s}")
      ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
      ("\\paragraph{%s}" . "\\paragraph*{%s}")
      ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))
     ("report" "\\documentclass[12pt,a4paper]{report}"
      ("\\part{%s}" . "\\part*{%s}")
      ("\\chapter{%s}" . "\\chapter*{%s}")
      ("\\section{%s}" . "\\section*{%s}")
      ("\\subsection{%s}" . "\\subsection*{%s}")
      ("\\subsubsection{%s}" . "\\subsubsection*{%s}"))
     ("book" "\\documentclass[12pt,a4paper]{book}"
      ;; ("\\part{%s}" . "\\part*{%s}")
      ("\\chapter{%s}" . "\\chapter*{%s}")
      ("\\section{%s}" . "\\section*{%s}")
      ("\\subsection{%s}" . "\\subsection*{%s}")
      ("\\subsubsection{%s}" . "\\subsubsection*{%s}"))))

  ;; -------------------------------------------------------------------
  ;; codigo
  ;; -------------------------------------------------------------------
  ;; Ejecuta bloques de código sin pedir confirmación
  (setq org-confirm-babel-evaluate nil)
  ;; Ejecuta los bloques de código al salvar el archivo
  (add-hook 'after-save-hook 'org-babel-tangle)

  ;; -------------------------------------------------------------------
  ;; general
  ;; -------------------------------------------------------------------
  (setq org-structure-template-alist
   '(("s" . "SRC")
     ("e" . "SRC emacs-lisp")
     ("E" . "EXAMPLE")
     ("q" . "QUOTE")
     ("v" . "VERSE")
     ("V" . "VERBATIM")
     ("c" . "CENTER")
     ("C" . "COMMENT")))

  (setq org-ellipsis " »")

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)
     (shell . t)
     (R . t)
     (calc . t)
     (gnuplot . t)
     (haskell . t)
     (latex . t)
     (org . t)
     (js . t)
     (java . t)
     (makefile . t)
     (C . t)))

  ;; -------------------------------------------------------------------
  ;; org link
  ;; -------------------------------------------------------------------
  (add-to-list 'org-file-apps '("\\.odt?\\'" . "open %s"))
  (add-to-list 'org-file-apps '("\\.ods?\\'" . "open %s"))
  (add-to-list 'org-file-apps '("\\.docx?\\'" . "open %s"))

  ;; añade un tipo de link para que emacs abra el fichero en Curio
  (defun open-curio (path)
    (shell-command (concat "open -a /Applications/Curio.app '" path "'")))
  (org-add-link-type "curio" 'open-curio)

  :bind
  (("C-c a" . org-agenda)
   ("C-c c" . org-capture)
   ("C-c b" . org-switchb)
   ("C-c t" . org-toggle-link-display)
   ("C-c l" . org-store-link))

  :hook
  ((org-mode-hook . (lambda () (visual-line-mode)))
   (org-mode-hook . (lambda () (scroll-bar-mode -1)))))


(use-package org-mac-link
  :after org
  :hook
  (org-mode-hook . (lambda ()
                (define-key org-mode-map
                  (kbd "C-c g") 'org-mac-grab-link))))

(use-package ob-async
  :straight t)

(use-package org-tempo
  :after org)

(require 'org-inlinetask)
