emacs/emacs-init.org
** COMMENT org-roam

#+begin_src emacs-lisp

  (use-package org-roam
    :disabled
    :ensure org-roam
    :disabled t
    :hook
    (after-init-hook . org-roam-mode)
    :custom
    ;(org-roam-directory "~/Sync/org/planes/")
    :bind (:map org-roam-mode-map
                (("C-c n l" . org-roam)
                 ("C-c n f" . org-roam-find-file)
                 ("C-c n g" . org-roam-show-graph))
                :map org-mode-map
                (("C-c n i" . org-roam-insert))))

#+end_SRC
** ox-hugo

#+begin_src emacs-lisp

  (use-package ox-hugo
    :straight t
    :config
    (with-eval-after-load 'ox
      (require 'ox-hugo))
    )

#+end_SRC

Plantilla para capturar nueva entrada

#+begin_src emacs-lisp

  (defun org-hugo-new-subtree-post-capture-template ()
    "Returns `org-capture' template string for new Hugo post.
  See `org-capture-templates' for more information."
    (let* (;; http://www.holgerschurig.de/en/emacs-blog-from-org-to-hugo/
           (date (format-time-string (org-time-stamp-format :long :inactive) (org-current-time)))
           (title (read-from-minibuffer "Post Title: ")) ;Prompt to enter the post title
           (fname (org-hugo-slug title)))
      (mapconcat #'identity
                 `(
                   ,(concat "* " title)
                   ":PROPERTIES:"
                   ,(concat ":EXPORT_HUGO_BUNDLE: " fname)
                   ,(concat ":EXPORT_DATE: " date) ;Enter current date and time
                   ":END:"
                   "#+begin_src yaml :front_matter_extra t"
                   "portada: 's'"
                   "resources:"
                   "  - src: "
                   "#+end_src"
                   "%?\n")                ;Place the cursor here finally
                 "\n")))

#+end_SRC
** gnuplot

#+begin_src emacs-lisp

  (use-package gnuplot
    :straight t
    )

#+end_SRC

** IDE (lsp)

*** lsp-mode

#+begin_SRC emacs-lisp

  (defun efs/lsp-mode-setup ()
    (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
    (lsp-headerline-breadcrumb-mode))

  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :hook (lsp-mode-hook . efs/lsp-mode-setup)
    :init
    (setq lsp-keymap-prefix "C-c l")
    :config
    (setq lsp-enable-which-key-integration t))

#+end_SRC

*** lsp-ui

#+begin_SRC emacs-lisp

  (use-package lsp-ui
    :straight t
    :hook (lsp-mode-hook . lsp-ui-mode)
    :custom
    (lsp-ui-doc-position 'bottom))

#+end_SRC

*** lsp-treemacs

#+begin_SRC emacs-lisp

  (use-package lsp-treemacs
    :straight t
    :after lsp)

#+end_SRC

** Debugging DAP mode

#+begin_SRC emacs-lisp

  (use-package dap-mode
    :straight t)

#+end_SRC

** ESS
#+begin_SRC emacs-lisp

  (use-package ess
    :straight t
    )

#+end_SRC
** C++

Modern C++ code highlighting

#+begin_src emacs-lisp

  (use-package modern-cpp-font-lock
    :straight t
    :init
    (eval-when-compile
      ;; Silence missing function warnings
      (declare-function modern-c++-font-lock-global-mode
                        "modern-cpp-font-lock.el"))
    :config
    (modern-c++-font-lock-global-mode t)
    )

#+end_SRC

Cofiguramos cc-mode

#+begin_src emacs-lisp

  (defvar my:compile-command "g++ -std=c++11")
  (use-package cc-mode
    :init
    (add-to-list 'auto-mode-alist '("\\.tpp\\'" . c++-mode))
    (add-to-list 'auto-mode-alist '("\\.h\\'" . c++-mode))
    (add-to-list 'auto-mode-alist '("\\.hpp\\'" . c++-mode))
    (add-to-list 'auto-mode-alist '("\\.cpp\\'" . c++-mode))
    :config
    (define-key c++-mode-map (kbd "C-c C-c") 'compile)
    (define-key c++-mode-map (kbd "C-c C-k") 'kill-compilation)
    (setq compile-command my:compile-command)

    (use-package google-c-style
      :straight t
      :config
      ;; This prevents the extra two spaces in a namespace that Emacs
      ;; otherwise wants to put... Gawd!
      (add-hook 'c-mode-common-hook 'google-set-c-style)
      ;; Autoindent using google style guide
      (add-hook 'c-mode-common-hook 'google-make-newline-indent)
      )
    )

#+end_SRC

** Haskell

#+begin_SRC emacs-lisp
  (use-package haskell-mode
    :straight t)
#+end_SRC

** Python

La principal herramienta que uso para trabajar con python es Elpy.

#+begin_src emacs-lisp

  (use-package elpy
    :straight t
    :init
    (elpy-enable)
    :hook (python-mode-hook . lsp-deferred))

#+end_SRC

** Html

#+begin_src emacs-lisp

  (use-package web-mode
    :straight t
    :mode ("\\.html$" . web-mode)
    )

#+end_SRC

** Php

#+begin_src emacs-lisp

  (use-package php-mode
    :straight t
    :mode ("\\.php$" . php-mode)
    :init
    (setq php-mode-coding-style (quote psr2))
    (setq php-search-documentation-browser-function 'eww-browse-url)
    (setq php-style-delete-trailing-whitespace 1)
    )

#+end_SRC

** Typoscript

#+begin_src emacs-lisp

  (use-package typoscript-mode
    :straight
    :mode ("\\.typoscript" . typoscript-mode))

#+end_SRC

** Tex - LaTeX - ConTeXt - AucTex

#+begin_src emacs-lisp

  (use-package tex
    :straight auctex
    :custom
    (TeX-auto-save t)
    (TeX-parse-self t)
    :config
    (setq-default TeX-master nil)
    (setq-default TeX-engine 'luatex)
    (add-hook 'TeX-mode-hook
          (lambda ()
            (local-set-key (kbd "º") "\\"))) ;muy útil para LaTeX
    )

#+END_SRC

*** ConTeXt

Usamos siempre Mark IV que ejecuta ConTeXt sobre el motor LuaTeX en vez de PDFTeX o XeTeX

#+begin_src emacs-lisp

  (setq ConTeXt-Mark-version "IV")

#+END_SRC

Para mejorar la visualización

#+begin_src emacs-lisp

  (add-hook 'TeX-mode-hook  #'visual-line-mode)
  ;; (add-hook 'TeX-mode-hook '(lambda () (switch-theme 'material)))

#+END_SRC

Configuración sugerida en http://wiki.contextgarden.net/AUCTeX

