emacs/.emacs.d/init.el

(use-package ox-hugo
  :straight t
  :config
  (with-eval-after-load 'ox
    (require 'ox-hugo))
  )

(defun org-hugo-new-subtree-post-capture-template ()
  "Returns `org-capture' template string for new Hugo post.
See `org-capture-templates' for more information."
  (let* (;; http://www.holgerschurig.de/en/emacs-blog-from-org-to-hugo/
         (date (format-time-string (org-time-stamp-format :long :inactive) (org-current-time)))
         (title (read-from-minibuffer "Post Title: ")) ;Prompt to enter the post title
         (fname (org-hugo-slug title)))
    (mapconcat #'identity
               `(
                 ,(concat "* " title)
                 ":PROPERTIES:"
                 ,(concat ":EXPORT_HUGO_BUNDLE: " fname)
                 ,(concat ":EXPORT_DATE: " date) ;Enter current date and time
                 ":END:"
                 "#+begin_src yaml :front_matter_extra t"
                 "portada: 's'"
                 "resources:"
                 "  - src: "
                 "#+end_src"
                 "%?\n")                ;Place the cursor here finally
               "\n")))

(defun efs/lsp-mode-setup ()
  (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
  (lsp-headerline-breadcrumb-mode))

(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :hook (lsp-mode-hook . efs/lsp-mode-setup)
  :init
  (setq lsp-keymap-prefix "C-c l")
  :config
  (setq lsp-enable-which-key-integration t))

(use-package lsp-ui
  :straight t
  :hook (lsp-mode-hook . lsp-ui-mode)
  :custom
  (lsp-ui-doc-position 'bottom))

(use-package lsp-treemacs
  :straight t
  :after lsp)

(use-package dap-mode
  :straight t)

(use-package modern-cpp-font-lock
  :straight t
  :init
  (eval-when-compile
    ;; Silence missing function warnings
    (declare-function modern-c++-font-lock-global-mode
                      "modern-cpp-font-lock.el"))
  :config
  (modern-c++-font-lock-global-mode t)
  )

(defvar my:compile-command "g++ -std=c++11")
(use-package cc-mode
  :init
  (add-to-list 'auto-mode-alist '("\\.tpp\\'" . c++-mode))
  (add-to-list 'auto-mode-alist '("\\.h\\'" . c++-mode))
  (add-to-list 'auto-mode-alist '("\\.hpp\\'" . c++-mode))
  (add-to-list 'auto-mode-alist '("\\.cpp\\'" . c++-mode))
  :config
  (define-key c++-mode-map (kbd "C-c C-c") 'compile)
  (define-key c++-mode-map (kbd "C-c C-k") 'kill-compilation)
  (setq compile-command my:compile-command)

  (use-package google-c-style
    :straight t
    :config
    ;; This prevents the extra two spaces in a namespace that Emacs
    ;; otherwise wants to put... Gawd!
    (add-hook 'c-mode-common-hook 'google-set-c-style)
    ;; Autoindent using google style guide
    (add-hook 'c-mode-common-hook 'google-make-newline-indent)
    )
  )

(use-package haskell-mode
  :straight t)

(use-package elpy
  :straight t
  :init
  (elpy-enable)
  :hook (python-mode-hook . lsp-deferred))

(use-package web-mode
  :straight t
  :mode ("\\.html$" . web-mode)
  )

(use-package php-mode
  :straight t
  :mode ("\\.php$" . php-mode)
  :init
  (setq php-mode-coding-style (quote psr2))
  (setq php-search-documentation-browser-function 'eww-browse-url)
  (setq php-style-delete-trailing-whitespace 1)
  )

(use-package typoscript-mode
  :straight
  :mode ("\\.typoscript" . typoscript-mode))

(use-package tex
  :straight auctex
  :custom
  (TeX-auto-save t)
  (TeX-parse-self t)
  :config
  (setq-default TeX-master nil)
  (setq-default TeX-engine 'luatex)
  (add-hook 'TeX-mode-hook
        (lambda ()
          (local-set-key (kbd "º") "\\"))) ;muy útil para LaTeX
  )

(setq ConTeXt-Mark-version "IV")

(add-hook 'TeX-mode-hook  #'visual-line-mode)
;; (add-hook 'TeX-mode-hook '(lambda () (switch-theme 'material)))
