emacs/.emacs.d/init.el

(use-package paren
  :custom
  (show-paren-style 'mixed)
  (show-paren-when-point-in-periphery t)
  (show-paren-when-point-inside-paren t)
  :config
  (show-paren-mode 1))

(use-package electric
  :custom
  (electric-pair-inhibit-predicate 'electric-pair-default-inhibit)
  (electric-pair-skip-self 'electric-pair-default-skip-self)
  (electric-quote-context-sensitive t)
  (electric-quote-paragraph nil)
  (electric-quote-string nil)
  :config
  (electric-indent-mode 1)
  (electric-pair-mode 1))

(use-package emacs
  :init
  (setq-default tab-always-indent 'complete)
  (setq-default tab-width 4))

(use-package emacs
  :custom
  (c-default-style "bsd")
  (c-basic-offset 4))

(use-package emacs
  :custom
  (fill-column 72)
  (sentence-end-double-space t)
  (sentence-end-without-period nil)
  (colon-double-space nil)
  :config
  (column-number-mode 1))

(use-package emacs
  :hook (before-save-hook . delete-trailing-whitespace))

(use-package emacs
  :config
  (setq scroll-preserve-screen-position t)
  (setq scroll-conservatively 1)
  (setq scroll-margin 0))

(use-package emacs
  :config
  (defun prot/toggle-line-numbers ()
    "Toggles the display of line numbers.  Applies to all buffers."
    (interactive)
    (if (bound-and-true-p display-line-numbers-mode)
        (display-line-numbers-mode -1)
      (display-line-numbers-mode)))

  (defun prot/toggle-invisibles ()
    "Toggles the display of indentation and space characters."
    (interactive)
    (if (bound-and-true-p whitespace-mode)
        (whitespace-mode -1)
      (whitespace-mode)))
  :bind (("<f7>" . prot/toggle-line-numbers)
         ("<f8>" . prot/toggle-invisibles)))

(use-package which-key
  :straight t
  :delight
  :config
  (setq which-key-show-early-on-C-h t)
  (setq which-key-idle-delay 10000)
  (setq which-key-idle-secondary-delay 0.05)
  (setq which-key-popup-type 'side-window)
  (setq which-key-show-prefix 'echo)
  (setq which-key-max-display-columns 3)
  (setq which-key-separator " ")
  (setq which-key-special-keys '("SPC" "TAB" "RET" "ESC" "DEL"))
  (which-key-mode 1))

(use-package emacs
  :custom
  (system-time-locale (getenv "LANG")))

(use-package parse-time
  :custom
  (parse-time-months '(("ene" . 1) ("feb" . 2) ("mar" . 3)
                       ("abr" . 4) ("may" . 5) ("jun" . 6)
                       ("jul" . 7) ("ago" . 8) ("sep" . 9)
                       ("oct" . 10) ("nov" . 11) ("dic" . 12)
                       ("enero" . 1) ("febrero" . 2)
                       ("marzo" . 3) ("abril" . 4) ("junio" . 6)
                       ("julio" . 7) ("agosto" . 8)
                       ("septiembre" . 9) ("octubre" . 10)
                       ("noviembre" . 11) ("diciembre" . 12)))
  (parse-time-weekdays '(("dom" . 0) ("lun" . 1) ("mar" . 2)
                         ("mié" . 3) ("jue" . 4) ("vie" . 5)
                         ("sáb" . 6) ("domingo" . 0) ("lunes" . 1)
                         ("martes" . 2) ("miércoles" . 3)
                         ("jueves" . 4) ("viernes" . 5)
                         ("sábado" . 6))))

(use-package calendar
  :custom
  (calendar-week-start-day 1)
  (calendar-day-name-array ["Domingo" "Lunes" "Martes" "Miércoles"
                            "Jueves" "Viernes" "Sábado"])
  (calendar-day-abbrev-array ["Dom" "Lun" "Mar" "Mié" "Jue" "Vie" "Sáb"])
  (calendar-day-header-array ["Do" "Lu" "Ma" "Mi" "Ju" "Vi" "Sá"])
  (calendar-month-name-array ["Enero" "Febrero" "Marzo" "Abril" "Mayo"
                              "Junio" "Julio" "Agosto" "Septiembre"
                              "Octubre" "Noviembre" "Diciembre"])
  (calendar-month-abbrev-array ["Ene" "Feb" "Mar" "Abr" "May" "Jun"
                                "Jul" "Ago" "Sep" "Oct" "Nov" "Dic"]))
